Revit 2026 API

# MacroManager Methods

---

The MacroManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddModule | Adds a MacroModule to the application. |
|  | Contains | Indicates the given module is a member of this collection. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetApplicationMacroSecurityOptions | Gets the application macro security options. |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMacroManager | Gets the Macro manager from the application. |
|  | GetMacroManagerIterator | Returns a Macro manager iterator that iterates through the collection. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | RemoveModule | Removes a MacroModule. |
|  | SetApplicationMacroSecurityOptions | Sets the application macro security options. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

MacroManager Class

Autodesk.Revit.DB.Macros Namespace